app/controllers/records_controller.rb

INSERT INTO "health_records" ("fatigue_score", "mood_score", "motivation_score", "flags", "note", "extra_metrics", "recorded_at", "timezone", "device_id", "app_version", "user_id", "created_at", "updated_at") VALUES (26, 65, 59, 40, '', NULL, '2026-02-26 14:57:46.597512', 'Asia/Tokyo', 'dev_lrnhn8300', '1.0.0', 1, '2026-02-26 14:57:46.601425', '2026-02-26 14:57:46.601425') RETURNING "id"
---
  def create
    @record = HealthRecord.new(record_params.merge(
      recorded_at: Time.current,
      user_id:     session[:user_id]
    ))

    respond_to do |format|
      if @record.save_to_s3